tutorials/arbitrary/system/patchSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes the inlet patch U field to VTK every 1 ms of simulation time so
    the effect of the syntheticTurbulenceInlet boundary condition can be
    visualised.

\*---------------------------------------------------------------------------*/

type                surfaces;
libs                ("libsampling.so");

interpolationScheme cellPoint;
surfaceFormat       vtk;

fields              (U);

writeControl        adjustableRunTime;
writeInterval       1e-3;
writeFields         false;

surfaces
(
    inlet
    {
        type        patch;
        patches     (inlet);
    }
);

// ************************************************************************* //
