tutorials/arbitrary/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. "${WM_PROJECT_DIR:?}/bin/tools/RunFunctions"      # Tutorial run functions

# Mesh
runApplication blockMesh

# Initial conditions
[ -d 0 ] || cp -r 0.orig 0

# Decompose for parallel run (cores set in system/decomposeParDict)
runApplication decomposePar

# Solve
runParallel "$(getApplication)"

# Reconstruct fields onto a single-process mesh
runApplication reconstructPar

#------------------------------------------------------------------------------
